/* 
  Localizable.strings
  MWeb

  Created by oulvhai on 15/12/12.
  Copyright © 2015年 Otis. All rights reserved.
*/


/* list panel right click menu */
"Open in New Window" = "在新窗口中打开";
"Move to Trash" = "移动到废纸篓";
"Put Back" = "还原";
"Delete" = "删除";
"Export as PDF..." = "导出为 PDF...";
"Export as HTML..." = "导出为 HTML...";
"Export as Markdown..." = "导出为 Markdown...";
"Show in Finder" = "在 Finder 中显示";

/* category panel right click menu */
"Edit" = "编辑";
"New Category" = "新增分类";
"New Sub Category" = "新增子分类";
"New Document" = "新建文档";
"Import Files To Library..." = "把文档导入到文档库...";
"Build Site" = "生成网站";
"Clear & Rebuild Site" = "清理并重新生成网站";
"Preview Site..." = "预览网站...";
"Build & Preview Site..." = "生成并预览网站...";
"Open Build Path in Finder..." = "在 Finder 中显示网站生成位置...";

"Build Site Errors!" = "生成网站时发生错误！";
"OK" = "确定";
"Building..." = "生成中...";
"Clear & Rebuilding..." = "清理并重新生成...";

/* folder pane right click menu */
"New Folder" = "新建文件夹";
"Expand All" = "全部展开";
"Collapse All" = "全部收起";
"Refresh" = "刷新";
"Unable to add as external source." = "无法增加外部文件夹。";

/* external folder attribute */
"File Name DESC" = "按文件名降序";
"File Name ASC" = "按文件名升序";
"Create Date DESC" = "按新增日期降序";
"Create Date ASC" = "按新增日期升序";
"Modify Date DESC" = "按修改日期降序";
"Modify Date ASC" = "按修改日期升序";
"Same as Preferences" = "与偏好设置相同";
"Enable Newlines to <br>" = "启用把换行转为 <br> 标签";
"Disable Newlines to <br>" = "禁用把换行转为 <br> 标签";
"Relative" = "相对位置";
"Absolute" = "绝对位置";

/* titlebar setting pane */
"Extension for %@" = "当前网站: %@";
"This HTML file name is existed!" = "此文档名已被使用!";


/* pdf export accessory view controller */
"Create a Table of Contents for PDF (Pro Only)." = "为生成的 PDF 增加大纲视图（付费版支持）。";


/* publish service */
"Update published document ( published in %@ )" = "更新已发布的文档 ( 最后一次发布于 %@ )";

"Error:" = "错误:";
"Please fill Blog URL!" = "请填入博客网址!";
"Please fill Publish URL!" = "请填入 API 地址!";
"Please fill Account!" = "请填入帐号!";
"Please fill Password!" = "请填入密码!";
"Validation failed! Can't get the blog info!" = "验证错误，无法取得博客信息!";

"faultCode:%@, faultMessage:%@." = "错误代码:%@， 错误信息:%@。";

/* publish tumblr */
"Please fill Tumblr Email!" = "请填入 Tumblr 的发布 Email!";
"Post to Tumblr by Email" = "用 Email 发布到 Tumblr";

/* evernote */
"Please fill Title!" = "请填入标题!";
/* wordpress.com */
"Fetch Categories Error:" = "获取分类时发生错误:";
"Fetch Post Error:" = "获取已发布的文章信息时发生错误:";

/* meduim */
"Please fill integration Token!" = "请填入 Integration Token!";
"Please try again!" = "请重试看看!";
"The integration Token is invalid or has been revoked." = "此 Integration Token 已无效或被删除！";
"You can get an integration Token at the bottom of the Settings page of your Medium account." = "你可以从 Medium 的帐号设置页面中的最底下获取 Integration Token ";
"Settings page" = "帐号设置页面";

/* local images upload */
"POST Header Data" = "POST Header 数据";
"POST Body Data" = "POST Body 数据";
"Please fill Name!" = "请填入名称!";
"Please fill API URL!" = "请填入 API 地址!";
"Please fill POST File Name!" = "请填入 POST File Name!";
"Please fill Response URL Path!" = "请填入图片 URL 路径!";
"Validation" = "验证";
"Success!" = "成功!";
"Uploaded Image URL is: %@" = "已上传图片的网址为: %@";
"Can't get access token!" = "无法获取 access token!";


/* extension */
"Please Fill Template Variables Name!" = "请填入模板的变量名!";
"This Template Variables Name is used!" = "此变量名已被使用!";

/* preferences */
"Typewriter Scrolling Activate when Content’s height %ld%% of Editor" = "当内容高度达到编辑器高度的 %ld%% 时启用打字机滚动(Typewriter Scrolling)";
"Choose" = "选择";
"General" = "通用设置";

"Cancel" = "取消";
"Delete selected items?" = "删除所选项吗?";
"Import" = "导入";
"Can't read the file!" = "不无读取此文件!";
"Error: %@" = "错误: %@";
"Parse json error!" = "解析 JSON 时发生错误!";
"Extension" = "扩展";

"Themes" = "主题&样式";
"Custom..." = "自定义...";

/* publish preferences */
"Delete the service?" = "确定删除此服务吗?";
"Deleted service cannot be restored." = "删除后将不能恢复！";
"Evernote service already added!" = "Evernote 服务已存在!";
"印象笔记 service already added!" = "印象笔记服务已存在!";
"%@ already added!" = "%@ 已存在!";
"Save Access Token Error:" = "保存 Access Token 时发生错误:";
"Can't find any blog in Blogger!" = "你的 Google 帐号中无任何 Blogger！请先增加 Blogger。";
"Publishing" = "发布服务";

/* backup */
"Backup Location 1 is not exsit, removed!" = "备份位置 1 不存在，已移除！ ";
"Backup Location 2 is not exsit, removed!" = "备份位置 2 不存在，已移除！ ";
"Backup Location 3 is not exsit, removed!" = "备份位置 3 不存在，已移除！ ";
"Last Backup: %@" = "上一次备份时间: %@";
"Last Backup: - " = "上一次备份时间: 无 ";
"Backup" = "备份";


/* cfawindowcontroller */
"No document in this category!" = "此分类中无任何文档!";
"Generating PDF..." = "生成 PDF...";
"Export" = "导出";
"Export documents error !" = "导出文档时发生错误 !";
"Insert" = "插入";
"Copy HTML" = "复制 HTML";
"There were some errors when parsing the stylesheet:" = "解析样式时发生一些错误:";
"Copy as Image" = "复制为图片";
"Save as Image..." = "保存为图片...";
"Save as PDF..." = "保存为 PDF...";
"Export as HTML..." = "导出为 HTML...";
"Copy as Rich Text" = "复制为富文本";
"Export as RTF..." = "导出为 RTF...";
"Export as Docx..." = "导出为 Docx...";
"Live Preview" = "实时预览";
"Upload Local Images to..." = "把本地图片传至图床...";
"Setting Publish to Wordpress, Evernote..." = "设置发布到 Wordpress, Evernote...";
"Delete the category?" = "确定删除此分类吗?";
"Deleted category cannot be restored." = "删除分类后将不能恢复！";
"Please select parent category !" = "请选择一个父分类 !";


/* cfaexternalcontroller */
"Please select a floder !" = "请选择一个文件夹 !";
"A subfolder of %@ is already used as external source %@" = "文件夹 \"%@\" 中包含有引入的文件夹 \"%@\"，无法增加！";
"The folder %@ is already part of the external source %@" = "子文件夹 \"%@\" 已经包含在引入的文件夹 \"%@\" 中了！";
"Unable to add as external source." = "无法引入此文件夹！";
"Remove the selected external source?" = "移除此引入的文件夹吗?";
"Delete the selected floder? The floder will move to trash!" = "确定删除所选文件夹吗？点确定后会把文件夹移到废纸蒌中！";
"Remove" = "移除";

/* appcontroller */
"Inbox" = "所有文档";
"Trash" = "废纸蒌";
"Recent" = "最近使用";

"EXTERNAL SOURCES" = "外部文件夹";
"Buy MWeb" = "购买 MWeb";

/* MWeb Lite's Documents Library is demo version of MWeb, If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you! */
"checkLiteVersionLibraryIsMaxDescription" = "MWeb Lite 的文档库功能只用于试用，限定不能超过 10 个文档，如果你喜欢 MWeb，请购买正式版来支持开发者！感谢！";

/* MWeb Lite's Publishing is demo version of MWeb. If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you! */
"checkLiteVersionPublishIsMaxDescription" = "MWeb Lite 的发布功能限定只能增加一个发布服务，如果你喜欢 MWeb，请购买正式版来支持开发者！感谢！";

/* MWeb Lite's External Source is demo version of MWeb. If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you! */
"checkLiteVersionExternalIsMaxDescription" = "MWeb Lite 的外部模式引入文件夹功能限定只能引入一个文件夹，如果你喜欢 MWeb，请购买正式版来支持开发者！感谢！";

/* MWeb Lite unsupport Local Images Upload Service. If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you! */
"checkLiteVersionLocalImagesUploadIsMaxDescription" = "MWeb Lite 不支持图床功能，如果你喜欢 MWeb，请购买正式版来支持开发者！感谢！";

/* MWeb Lite is demo version of MWeb. If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you! */
"checkLiteVersionGeneralDescription" = "MWeb Lite 只用于试用，如果你喜欢 MWeb，请购买正式版来支持开发者！感谢！";

"Preferences" = "偏好设置";

/*cfa category eidt */
"Category_Orderby_Newest on Top" = "最新在前";
"Category_Orderby_Oldest on Top" = "最旧在前";
"Category_Orderby_Custom" = "自定义拖拽排序";
"Category_Orderby_Title" = "按标题";














